[{"Name":"Secretlab Titan Evo 2022","subtitle":"Best gaming chair for plush comfort","img":"https://cdn.shopify.com/s/files/1/1640/2231/t/384/assets/2022-titan-evo-splash-right-min.png?v=16283714428025595886","spec":"Maximum load: 290 pounds, Dimensions: 29.5 x 27.5 x 57 inches (W x D x H) Seat height: 19.5 - 23 inches (minimum to maximum)","summary":"Extra-large seat, Adjustable, integrated lumbar support, High-quality design and construction","details":"The Secretlab Titan Evo 2022 is everything weve been looking for in a gaming chair. Thats why its rightfully taken the top spot in our best gaming chair guide from the previous incumbent, the Secretlab Titan. It was an easy decision to make, though. The Secretlab Titan Evo 2022 does everything the Titan, and Omega below, can, except better.","price":429},{"Name":"Noblechairs Epic Real Leather","subtitle":"A leather-clad beauty","img":"https://img.overclockers.co.uk/media/image/GC005NC_190244.jpg","spec":"Dimensions: 84 x 38 x 70 cm (W × D × H)Seat height:: 131 - 141 cm (minimum to maximum)Maximum load: 180kg","summary":"Uses real leather, Extensive adjustabliity, Premium quality, Easy to set up","details":"The Noblechairs Epic Real Leather is a real contender for the best gaming chair crown. From the cross-thatched embroidery to the real leather of its name, if you’re looking for a no-compromises gaming throne, this is it. Plus, it’s surprisingly quick and easy to set up. And once youre done the Epic Real Leather is a dream to sit on. You can customize your position however you want. Just do us a favor, and read the instructions while you’re setting it up. Synthetic leather is also an option if you want to save some money.","price":470},{"Name":"Anda Seat T-Pro 2","subtitle":"Looks fetching in fabric","img":"https://i.pcmag.com/imagery/reviews/05S5PWk0y8LsSKOxEqWRyyQ-1.1618429423.fit_lim.size_1050x591.jpg","spec":"Dimensions: 84 x 38 x 70 cm (W × D × H)Seat height:: 131 - 141 cm (minimum to maximum)Maximum load: 180kg","summary":"Premium materials, Sturdy construction, Premium quality, Supportive ergonomic shape","details":"We think fabric chairs without too many aggressive-looking cut-outs are great for folk who want a gaming chair that fits into a normal room well. Not all of us have entire rooms dedicated to gaming, after all. A fabric weave will generally feel less hot and sweaty than PU leather, but is also less easy to wipe down. Eat dinner while playing most nights? Fabric might not be the best choice unless your spill rate is pretty low. ","price":499},{"Name":"Autonomous ErgoChair 2","subtitle":"Gaming with class","img":"https://www.swaggermagazine.com/home/wp-content/uploads/2020/09/ErgoChair2.jpg","spec":"Dimensions: 47 x 27 x 20 in (H × W × D)Seat height: (Minimum to maximum: 18 - 20 inMaximum load: 300 lbs","summary":"Comfortable and ergonomic, Stylish, minimal design for hybrid environments, Solid construction","details":"Marketed as an office chair, the ErgoChair 2 has a very modern and stylish aesthetic to it that will appeal to anyone that doesn’t use RGB as a personality trait. It’s not all style, either, as the ErgoChair will also let you adjust basically every part of the chair, so that no matter how your body is built, you’re guaranteed to be comfortable while gaming. ","price":355},{"Name":"SecretLab Omega 2020","subtitle":"Floating on sublime comfort","img":"https://cdn.shopify.com/s/files/1/2360/6457/products/OMEGA-2020-ROYAL-1_400x.jpg?v=1626092637","spec":"Dimensions: 27 x 27.5 x 53.5 inches (W x D x H)Seat height: 18 - 21.5 inches (minimum to maximum)Maximum load: 240 pounds","summary":"Extremely plush neck and lumbar pillows, Stylish, High-quality design, Reasonably priced","details":"Incorporating that sleek, Mad Men-level sophistication with that SciFi gaming look, the SecretLab Omega 2020 is simply stunning, especially if you opt for the PU leather or high-end Napa leather models. But, the SecretLab Omega doesn’t just rely on looks alone; one of the best gaming chairs of 2021, this one comes with a head pillow and a lumbar pillow – both memory foam – and offers even better support than its predecessor. ","price":240},{"Name":"Razer Iskur","subtitle":"A solid first effort","img":"https://www.startech.com.bd/image/cache/catalog/gaming-chair/razer/iskur/iskur-side-500x500.jpg","spec":"Dimensions: 66.55 x 74.55 x 137.11 cm (W × D × H)Seat height (Minimum to maximum): 174 to 181 cmMaximum load: Less than 136kg","summary":"Premium construction, Firm but comfortable, Built-in adjustable lumbar support","details":"Razer is no stranger to gaming peripherals, but this is the first time it’s entered the gaming chair market and we must say, it’s certainly a solid first effort. The Razer Iskur is a high-quality gaming throne that rounds out your Razer-filled set up quite nicely. ","price":379},{"Name":"Corsair T2 Road Warrior","subtitle":"Comfort from the masters of gaming","img":"https://www.corsair.com/corsairmedia/sys_master/productcontent/cf-9010006-ww-t2_chair_blk_03.png","spec":"Dimensions: 50 x 56 x 80 cm (W × D × H)Seat height: (Minimum to maximum: 51.5 - 60 cmMaximum load: 136 kg","summary":"Easy to assemble, Comfortable microfibre materials, Roller skate style wheels to protect flooring","details":"Corsair is known for making popular and high-end PC components and gaming peripherals, and now it’s making a mark in PC gaming chairs. This has resulted in one of the best gaming chairs we’ve ever sat in.","price":318},{"Name":"Noblechairs Icon gaming chair","subtitle":"A luxury gaming chair","img":"https://brain-images-ssl.cdn.dixons.com/3/4/10205843/u_10205843.jpg","spec":"Dimensions: 87 x 37 x 70 cm (W × D × H)Seat height: (Minimum to maximum): 48 - 58 cmMaximum load: 180 kg","summary":"Premium materials, Very comfortable, Unique backrest design","details":"Noblechairs is well known for crafting some of the best gaming chairs out there – and the Noblechairs Icon makes it clear why. While it’s more affordable than the flagship Epic Real Leather, it’s still extremely comfortable and one of the best PC gaming chairs out there. ","price":298},{"Name":"Edge GX1","subtitle":"A gaming chair that puts ergonomics first","img":"https://aoneplus.com/wp-content/uploads/2021/01/2-3.jpg","spec":"Seat height: (Minimum to maximum: 480 – 590 mmMaximum load: 150kg","summary":"Very adjustable, Premium design, Ergonomic base and backrest","details":"The Edge GX1 is a gaming chair that actively avoids the popular racing style that is increasingly popular with modern gaming chairs. Rather than sticking to a form factor that’s designed to limit your movement, the Edge GX1 instead aims to give an ergonomic experience, where comfort is the priority – while also providing a premium chair. ","price":255},{"Name":"Andaseat Fnatic Edition","subtitle":"A gaming chair that puts ergonomics first","img":"https://www.techadvisor.com/cmsdata/reviews/3801708/andaseat_dark_demon2.jpg","spec":"Dimensions: 16.14 x 14.96 x 19.29in (W × D × H)Seat height: (Minimum to maximum: 19.20 - 24.5 inMaximum load: 160kg","summary":"Ultra-comfy and supportive, Great recline feature allows for napping, Roomy seat means you can cross your legs","details":"We have reviewed a bunch of Andaseat gaming chairs. The Fnatic Edition is our current fave, worth considering whether you like esports team Fnatic or have no idea who they are. ","price":485}]